app/views/events/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 1]]
---
        <td>
          <span style="color:red">♥</span> <%= event.likes.count %>