app/views/events/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
</ul>
<p><%= @event.likes.count %> <%= (@event.likes.count) == 1 ? 'Like' : 'Likes'%></p>
<% pre_like = @event.likes.find { |like| like.user_id == current_user.id} %>