app/controllers/events_controller.rb

  def show
    id = params[:id] # retrieve event ID from URI route
    @event = Event.find(id) # look up event by unique ID
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 4]]

  def index
    @all_freebies = Event.all_freebies
    @events = Event.with_freebies(freebies_list, sort_by)
    @freebies_to_show_hash = freebies_hash
    @sort_by = sort_by
    @user = User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def share
    id = params[:id] # retrieve event ID from URI route
    @event = Event.find(id) # look up event by unique ID
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 21]]

  def create
    @event = Event.create!(event_params)
---
INSERT INTO "events" ("title", "freebie", "event_time", "affiliation", "image", "event_date") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Beach Ball Giveaway at Ferris"], ["freebie", "MERCH"], ["event_time", "3 pm"], ["affiliation", ""], ["image", ""], ["event_date", "2022-11-16"]]

  def edit
    @event = Event.find params[:id]
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 4]]

  def update
    @event = Event.find params[:id]
    @event.update_attributes!(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "events" SET "image" = ?, "owner" = ? WHERE "events"."id" = ?  [["image", "https://lh3.googleusercontent.com/D_KeOAlkL7DOC4RxjVKDxr8a_Ii4T2pcxfAXjebnYgV7-NiIJ6o4M9mTjPoauK_9V6M=w2400"], ["owner", "rchung"], ["id", 2]]