app/controllers/likes_controller.rb

    def create
        @event.likes.create(user_id: User.find_by_id(session[:user_id]).id)
---
INSERT INTO "likes" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 1], ["created_at", "2022-11-16 06:42:36.954288"], ["updated_at", "2022-11-16 06:42:36.954288"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

    def destroy
        @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]

    def find_like
        @like = @event.likes.find(params[:id])
---
SELECT  "likes".* FROM "likes" WHERE "likes"."event_id" = ? AND "likes"."id" = ? LIMIT 1  [["event_id", 1], ["id", 1]]

    def find_event
        @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]