app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "WWII story of Alan Turing"], ["updated_at", "2022-10-26 18:41:57.094460"], ["id", 4]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]
---
  def search
    @similar_movies = Movie.similar_movies(params[:title])
    if @similar_movies.nil?
      redirect_to root_url, alert: "'#{params[:title]}' has no director info"
    end
    @movies = Movie.find_by(title: params[:title])