app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "anna123@columbia.edu"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "anna123"]]
INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at", "confirm_token") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    # session[:user_id] = @user.id
    if User.find_by(email: user_params[:email])
      flash[:warning] = "Email is already associated with another account. Please try creating another account."

    elsif User.find_by(username: user_params[:username])
      flash[:warning] = "Username is already associated with another account. Please try creating another account."

    elsif !("@columbia.edu".in? user_params[:email]) && !("@barnard.edu".in? user_params[:email])
      flash[:warning] = "Email is not valid. Please try creating another account with a columbia/barnard email."

    else
      @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."confirm_token" IS NULL LIMIT 1
---
  def confirm_email
    # user = User.find_by_confirm_token(user_params[:email])
    user = User.find_by_confirm_token(params[:email])